In [28]:
import pandas as pd
import re

In [59]:
df = pd.read_html('https://rds2.northsouth.edu/index.php/common/showofferedcourses/')

In [60]:
df = df[0]

In [61]:
df = df.iloc[:, 1:]
df.head()

   Course  Section Faculty                    Time    Room  Seats Available
0  ACT201        1     TBA  MW 11:20 AM - 12:50 PM  NAC993               44
1  ACT201        2     TBA  MW 09:40 AM - 11:10 AM  SAC401               30
2  ACT201        3     TBA  MW 11:20 AM - 12:50 PM  NAC201               30
3  ACT201        4     TBA  MW 02:40 PM - 04:10 PM  NAC410               42
4  ACT201        5     TBA  MW 01:00 PM - 02:30 PM  NAC210               38

In [17]:
df.to_csv('201.csv', index = False)

In [20]:
new_df = pd.read_csv('201.csv')
new_df = new_df.iloc[:, [0, 1, 2, 3]]
new_df.head()

   Course  Section Faculty                    Time
0  ACT201        1     TBA  MW 11:20 AM - 12:50 PM
1  ACT201        2     TBA  MW 09:40 AM - 11:10 AM
2  ACT201        3     TBA  MW 11:20 AM - 12:50 PM
3  ACT201        4     TBA  MW 02:40 PM - 04:10 PM
4  ACT201        5     TBA  MW 01:00 PM - 02:30 PM

In [23]:
temp = new_df['Time']
temp[:5]

0    MW 11:20 AM - 12:50 PM
1    MW 09:40 AM - 11:10 AM
2    MW 11:20 AM - 12:50 PM
3    MW 02:40 PM - 04:10 PM
4    MW 01:00 PM - 02:30 PM
Name: Time, dtype: object

In [46]:
temp = new_df['Time']
df = new_df.iloc[:, :-1]

In [51]:
day = []
time = []
for i in temp:
    split = re.split(' ', i)
    day.append(split[0])
    temp = ''.join(split[1:])
    temp = re.sub('[^A-Za-z0-9]', '', temp)
    time.append(temp)

In [56]:
df['Day'] = day
df['Time'] = time
df.head()

   Course  Section Faculty Day          Time
0  ACT201        1     TBA  MW  1120AM1250PM
1  ACT201        2     TBA  MW  0940AM1110AM
2  ACT201        3     TBA  MW  1120AM1250PM
3  ACT201        4     TBA  MW  0240PM0410PM
4  ACT201        5     TBA  MW  0100PM0230PM

In [57]:
df.to_csv('201new.csv', index = False)